In [1]:
import pandas as pd
import shutil

In [2]:
shutil.copy(
    "/kwiat/vector/ag1000g/release/phase2.AR1/samples/cross.samples.meta.txt", 
    "../meta/ag1000g/")

'../meta/ag1000g/cross.samples.meta.txt'

In [3]:
# include...

In [4]:
cross_meta_tab = pd.read_table("../meta/ag1000g/cross.samples.meta.txt", index_col=0)

In [5]:
cross_meta_tab.head()

    ox_code cross     role    n_reads  median_cov   mean_cov  sex  colony_id
0  AD0142-C  18-5   parent   60486753          26  25.824447    F      Ghana
1  AD0143-C  18-5   parent   58509103          19  18.800118    M  Kisumu/G3
2  AD0146-C  18-5  progeny  101612499          44  43.494594  NaN        NaN
3  AD0147-C  18-5  progeny   50710020          16  16.284487  NaN        NaN
4  AD0148-C  18-5  progeny   59023991          19  18.978021  NaN        NaN

In [6]:
g = cross_meta_tab.groupby(["role", "cross"])

In [7]:
df = pd.DataFrame(
    index=cross_meta_tab.cross.unique(),
    columns=["mother_colony", "father_colony", "n_progeny"])
df.index.name ="cross_id"

In [8]:
parg = cross_meta_tab.groupby(["sex", "role", "cross"])

In [9]:
df.sort_index(inplace=True)

In [10]:
df["father_colony"] = parg.colony_id.first()["M"]["parent"]
df["mother_colony"] = parg.colony_id.first()["F"]["parent"]

In [11]:
df["n_progeny"] = g.size()["progeny"]

In [12]:
df

         mother_colony father_colony  n_progeny
cross_id
18-5             Ghana     Kisumu/G3         20
29-2             Ghana        Kisumu         20
36-9             Ghana          Mali         20
37-3            Kisumu     Pimperena         20
42-4              Mali  Kisumu/Ghana         14
45-1              Mali        Kisumu         20
46-9         Pimperena          Mali         20
47-6              Mali        Kisumu         20
73-2             Akron         Ghana         19
78-2              Mali  Kisumu/Ghana         19
80-2            Kisumu         Akron         20